ЭкзаменационнаяЗадача/src/Documents/ПоступлениеКниг/ПоступлениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКниг</name>
  <registerRecords>AccumulationRegister.НаличиеКнигНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.УчетПоступления</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>InformationRegister.ПрайсЛист</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемщик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКниг</name>
    <attributes>
      <name>НазваниеКниги</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоставщика</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЭкзаменационнаяЗадача/src/Documents/ПоступлениеКниг/Forms/ФормаДокумента/Module.bsl
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда

		Объект.Приемщик = ПолучениеДанныхТекущегоСеансаСервер.ВернутьЗначениеПараметраСеансаТекущийПользователь();
		Объект.Склад = ОбщегоНазначенияСервер.ПолучитьЗначениеТекущегоМагазина(Объект.Приемщик);
    КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКниг

&НаКлиенте
Процедура СписокКнигЦенаПоставщикаПриИзменении(Элемент)
	
	РасчитатьСумму();
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	ПроцентНаценки = ОбщегоНазначенияСервер.ПолучитьЗначениеНаценки(); 
	
	Элементы.СписокКниг.ТекущиеДанные.РозничнаяЦена = ЦенаПоставщика * (1 + ПроцентНаценки / 100);
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокКнигКоличествоПриИзменении(Элемент)
	РасчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СписокКнигНазваниеКнигиПриИзменении(Элемент)
	Элементы.СписокКниг.ТекущиеДанные.Количество = 1;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьСумму()
	
	ЦенаПоставщика = Элементы.СписокКниг.ТекущиеДанные.ЦенаПоставщика;
	Количество = Элементы.СписокКниг.ТекущиеДанные.Количество;
	
	Если Количество = 0 Или ЦенаПоставщика = 0 Тогда
		Возврат;
	КонецЕсли;
	 
	Элементы.СписокКниг.ТекущиеДанные.Сумма = Количество * ЦенаПоставщика;
	
	Объект.Сумма = Объект.СписокКниг.Итог("Сумма");
	
КонецПроцедуры


#КонецОбласти
